Tekla Open API Reference for Tekla Structures 2025
DimensionFormatAttributes Constructor
Overload List
Name | Description
DimensionSetBaseAttributes.DimensionFormatAttributes()
 Creates a new dimension format attributes instance. By default the format rounds the dimension value to the nearest whole and shows it with no decimals. The unit is selected automatically.
DimensionSetBaseAttributes.DimensionFormatAttributes(DimensionSetBaseAttributes.DimensionValuePrecisions, DimensionSetBaseAttributes.DimensionValueFormats, DimensionSetBaseAttributes.DimensionValueUnits)
 Creates a new dimension format attributes instance with the given parameters.
Top
See Also
Reference
DimensionSetBaseAttributes.DimensionFormatAttributes Class
Tekla.Structures.Drawing Namespace